Conv_malla_0deg_253k/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         30000;

deltaT          1;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      1;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
  forceCoeffs1
       {
        type forceCoeffs;
        libs ("libforces.so");
        writeControl timeStep;
        writeInterval 10;
        log true;
        patches (airfoil);
        rho rhoInf;                         // Indicates incompressible.
        rhoInf 1.1764;                        // Redundant for incompressible (value does not matter).
        liftDir (0 1 0);
        dragDir (1 0 0);
        CofR (0.25 0 0);                    // Quarter-chord.
        pitchAxis (0 0 1);
        magUInf 51.4815;                      // Matches 0/U.
        lRef 1.0;                           // Normalized chord.
        Aref 1;                           // Cell depth * chord.
        }

    #includeFunc Surfaces;
}


// ************************************************************************* //
